public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");

        //2. Создать переменные всех пройденных типов данных, и инициализировать их значения;
        initVars();


        /*
            3. Написать метод вычисляющий выражение a * (b + (c / d))
            и возвращающий результат,где a, b, c, d – входные параметры этого метода;
         */

    }

    public static void initVars(){
        byte b = 1;
        short sh = 2;
        int i = 3;
        long l = 4L;
        float f = 4.5F;
        double d = 4.58;
        boolean bl = true;

    }


    public static void 

}
